In [85]:
import pandas as pd

!pip install xlrd 

import statistics

# xlrd is a module which pandas requires to read in excel files.

Requirement already satisfied: xlrd in c:\users\euzoe\anaconda\lib\site-packages (2.0.1)

In [ ]:
x=pd.read_csv('C:/Users/euzoe/OneDrive/Desktop/DATA ANALYSIS/Dataset/Plastic waste generation 2010.csv') #to read a csv file

In [ ]:
data name = (x.loc[x['column name to select from'] > 20]) #to select values > 20 in the dataframe.

In [ ]:
(x.loc[x['column name to select from'] > 20], inplace = True) #to select values > 20 in the dataframe and update the 
#original data ("inplace = True" function)

In [ ]:
import plotly.express as px #for data visualisation

In [ ]:
fig = px.bar(data name, y='value', x='value') #to plot a bargraph
fig.show()

In [ ]:
fig = px.bar(data name, y='value', x='value', color = 'y value', color_continuous_scale = ['red', 'green', 'blue']) #to plot bargraph with multiple colors
fig.show()

In [ ]:
#to plot a geomap
fig = px.choropleth(data name,
                    locations = 'Code', #mainly for country codes as in the dataset
                    locationmode = 'ISO-3', #The 'locationmode' property is an enumeration that may be specified as: One of the following enumeration values:['ISO-3', 'USA-states', 'country names', 'geojson-id']
                    scope = 'world', #The 'scope' property is an enumeration that may be specified as: #One of the following enumeration values:
                                            #['world', 'usa', 'europe', 'asia', 'africa', 'northamerica', 'south america']

                    color = 'Plastic waste generation',
                    hover_name = 'Entity',
                    hover_data = ['Plastic waste generation', 'Code'],
                    color_continuous_scale = 'armyrose',
                    title = 'Plastic waste generation 2010 by country')
fig.show()

In [ ]:
new data name= data name.rename(columns = {'name in the dataframe' : 'new name'}) #to rename a column from a dataframe

In [ ]:
fig = px.scatter(data name, y='value', x='value') #to plot scatterd plot
fig.show()

In [ ]:
data name.isnull().sum() #to check for missing values in a dataset

In [ ]:
import pandas_profiling as pp #to get the overview of the entire dataframe including correlation matrix
pp.ProfileReport(data name)

In [ ]:
df.shape #to get number of columns and rows in the dataset

In [ ]:
#option on how to handle missing values
#Dropping method: dropna, subset  and interpolation method

#1. Dropna method 
data name.dropna(how='all').shape #to drop a row if all of its values are missing.

#2. subset method
data name.dropna(subset=['geoId', 'countryterritoryCode', 'popData2019', 'Cumulative_number_for_14_days_of_COVID-19_cases_per_100000'], 
             how ='any').shape #to drop a row if either of the 4 columns are missing for a given row

#3. #(interpolate method): to make a guess on missing values using interpolation

In [ ]:
df['column name'].value_counts() #value_counts() is used to check how many times the value occured in this column name

In [ ]:
df.fillna(value='0', inplace=True)  #to fill the missing values (Na) with 0

In [ ]:
# create another column for country code 
data name['CODE']=alpha3code(data name.column with the country names)

data name.head() #to view the dataframe

In [ ]:
#Reading and writing a file

In [ ]:
#writing

In [7]:
newfile=open('C:/Users/euzoe/OneDrive/Desktop/DATA ANALYSIS/Reading and writing/new.txt', 'w') 
newfile.write('i love python')
newfile.close()

#new.txt is the name of thefiles written saved in the location (C:/Users/euzoe/OneDrive/Desktop/DATA ANALYSIS/Reading and 
#writing). the 'w' means to write.

In [4]:
newfile=open('C:/Users/euzoe/OneDrive/Desktop/DATA ANALYSIS/Reading and writing/new.txt', 'a') #'a' allows you to add/append
#more texts without without changing the previous one.
newfile.write('\ni love coding')
newfile.close()

In [ ]:
#reading

In [4]:
new1_read=open('C:/Users/euzoe/OneDrive/Desktop/DATA ANALYSIS/Reading and writing/new1.txt', 'r') #'a' allows you to read a file
#a file saved in this particular location.

In [5]:
print(new1_read.read())

i love python.
there is nothing more satisfying and
promising than having a skill like this

In [18]:
new1_read=open('C:/Users/euzoe/OneDrive/Desktop/DATA ANALYSIS/Reading and writing/new1.txt', 'r')
for line in new1_read:
    print(line)
    
    
new1_read.close()

i love python.

there is nothing more satisfying and

promising than having a skill like this

In [19]:
new1_read=open('C:/Users/euzoe/OneDrive/Desktop/DATA ANALYSIS/Reading and writing/new1.txt', 'r')
for line in new1_read:
    tokens=line.split(' ')
    print(tokens)
    
    
new1_read.close()

['i', 'love', 'python.\n']
['there', 'is', 'nothing', 'more', 'satisfying', 'and', '\n']
['promising', 'than', 'having', 'a', 'skill', 'like', 'this']

In [20]:
new1_read=open('C:/Users/euzoe/OneDrive/Desktop/DATA ANALYSIS/Reading and writing/new1.txt', 'r')
for line in new1_read:
    tokens=line.split(' ')
    print(len(tokens))
    
    
new1_read.close()

3
7
7

In [ ]:
#how to carve out a particular column from a table

In [1]:
import pandas as pd
df=pd.read_csv('C:/Users/euzoe/OneDrive/Desktop/DATA ANALYSIS/Dataset/Plastic waste generation 2010.csv') #to read a csv file

In [23]:
df.head()

                Entity Code  Plastic waste generation (tonnes, total)
0              Albania  ALB                                     73364
1              Algeria  DZA                                   1898343
2               Angola  AGO                                    528843
3  Antigua and Barbuda  ATG                                     22804
4            Argentina  ARG                                   2753550

In [22]:
y=df[['Entity', 'Code']] #to take only columns 'Entity' and 'Code'

In [24]:
y.head()

                Entity Code
0              Albania  ALB
1              Algeria  DZA
2               Angola  AGO
3  Antigua and Barbuda  ATG
4            Argentina  ARG

In [38]:
y.loc[0:3, 'Entity': 'Code'] #to selcéct the first 4 rows and two columns (Entity and Code)

                Entity Code
0              Albania  ALB
1              Algeria  DZA
2               Angola  AGO
3  Antigua and Barbuda  ATG

In [40]:
df.loc[0:3, 'Entity':'Plastic waste generation (tonnes, total)'] #loc takes argument with row index and columns names

                Entity Code  Plastic waste generation (tonnes, total)
0              Albania  ALB                                     73364
1              Algeria  DZA                                   1898343
2               Angola  AGO                                    528843
3  Antigua and Barbuda  ATG                                     22804

In [48]:
new_df=df.rename(columns={'Plastic waste generation (tonnes, total)':'Tones'}) #to rename a column

In [50]:
new_df.head()

                Entity Code    Tones
0              Albania  ALB    73364
1              Algeria  DZA  1898343
2               Angola  AGO   528843
3  Antigua and Barbuda  ATG    22804
4            Argentina  ARG  2753550

In [55]:
new_df.iloc[0:4,0:4] #iloc (or ix) takes argument with indices of both row and columns

                Entity Code    Tones
0              Albania  ALB    73364
1              Algeria  DZA  1898343
2               Angola  AGO   528843
3  Antigua and Barbuda  ATG    22804

In [57]:
new_df['Tones']<=1000

0      False
1      False
2      False
3      False
4      False
       ...
163    False
164    False
165    False
166    False
167    False
Name: Tones, Length: 168, dtype: bool

In [58]:
#to save a datafram from internet as csv in a particular folder in your pc

In [62]:
import pandas as pd

In [74]:
drink = pd.read_csv('http://bit.ly/drinksbycountry')

In [64]:
path='C:/Users/euzoe/OneDrive/Desktop/DATA ANALYSIS/Reading and writing/drinksbycountry.csv'

In [65]:
drink.to_csv(path)

In [66]:
#Describe
#If we would like to get a statistical summary of each column, such as count, column mean value, column standard deviation, 
#etc. We use the describe method:

In [67]:
drink.describe() #statistical summary of the data

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [ ]:
#This shows the statistical summary of all numeric-typed (int, float) columns.
#For example, the attribute "beer_servings" has 193 counts, the mean value of this column is 106, the standard deviation 
#is 101, the minimum value is 0, 25th percentile is 20, 50th percentile is 76, 75th percentile is 188, and the maximum value 
#is 376.

In [68]:
#However, what if we would also like to check all the columns including those that are of type object.

drink.describe(include = "all")

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
count,193,193.000000,193.000000,193.000000,193.000000,193
unique,193,NaN,NaN,NaN,NaN,6
top,Nepal,NaN,NaN,NaN,NaN,Africa
freq,1,NaN,NaN,NaN,NaN,53
mean,NaN,106.160622,80.994819,49.450777,4.717098,NaN
std,NaN,101.143103,88.284312,79.697598,3.773298,NaN
min,NaN,0.000000,0.000000,0.000000,0.000000,NaN
25%,NaN,20.000000,4.000000,1.000000,1.300000,NaN
50%,NaN,76.000000,56.000000,8.000000,4.200000,NaN
75%,NaN,188.000000,128.000000,59.000000,7.200000,NaN
max,NaN,376.000000,438.000000,370.000000,14.400000,NaN

In [69]:
#select particular columns by name of columns

drink[['country', 'beer_servings', 'spirit_servings']]

         country  beer_servings  spirit_servings
0    Afghanistan              0                0
1        Albania             89              132
2        Algeria             25                0
3        Andorra            245              138
4         Angola            217               57
..           ...            ...              ...
188    Venezuela            333              100
189      Vietnam            111                2
190        Yemen              6                0
191       Zambia             32               19
192     Zimbabwe             64               18

[193 rows x 3 columns]

In [78]:
#to identify data types in pandas
df.dtypes()

#to convert data types
df.astype('int' or 'float' or 'object')

In [ ]:
#data pre-processing

#data normalization
#data binning

In [ ]:
#data normalisation- 3 methods 

#1. simple feature scaling

    # xnew=xold/oldmax

#2. min-max

    #xnew = xold-xmin/xmax-xmin

#3. z-score or standard score
    #xnew = xold-mean/std

In [ ]:
#data binning: grouping of data into 'bins'

#you can bin age into [0 to 5], [6 to 10], [11 to 15] and so on. Sometimes, binning can improve accuracy of the 
#predictive models.

#converts numerical variables into categorical variables.

#group numerical variables into bins e.g Using binning, we categorize price into three bins: low price, medium price, 
#and high

In [ ]:
#convert categorical variables to numeric (dummy variables) 0 or 1, using pandas dummy.

pd.get_dummies(df['column name'])

In [ ]:
#What is the purpose of Data Wrangling?
#Data Wrangling is the process of converting data from the initial format to a format that may be better for analysis.

#check autos lab note for exercise

In [ ]:
#to add 1 to all the elements in the column 'symbolling'

df['symbolling'] = df['symbolling'] + 1

In [1]:
#to calculate the mean of a list 

def mean(list_of_nums):
    total=0
    for num in list_of_nums:
        total=total + num
    return total / len(list_of_nums)
print(mean([2,4,6,7,8,9,2,2,1,11,22,3,3,4,5,5,6,6,8,8,90,0,0,9.2]))

9.216666666666667

In [ ]:
#INTRO TO PYTHON

In [2]:
a=56+90
b=21/23

In [4]:
c=a*b
print(f'The result of this complex calculation is {c}')

The result of this complex calculation is 133.30434782608694

In [6]:
#Python For Loops
#Print each fruit in a fruit list:

fruits = ["apple", "banana", "cherry"]
for x in fruits:
  print(x)

apple
banana
cherry

In [7]:
#Looping Through a String
#Even strings are iterable objects, they contain a sequence of characters:

#Example
#Loop through the letters in the word "banana":

for x in "banana":
  print(x)

b
a
n
a
n
a

In [16]:
#The break Statement
#With the break statement we can stop the loop before it has looped through all the items:

#Example
#Exit the loop when x is "banana":

fruits = ["apple", "banana", "cherry"]
for x in fruits:
  print(x)
  if x == "banana":
    break

apple
banana

In [22]:
fruits = ["apple", "banana", "cherry"]
for x in fruits:
  if x == "banana":
    break
  else:
    print(f'The fruit before banana is {x}')

The fruit before banana is apple

In [25]:
#The continue Statement
#With the continue statement we can stop the current iteration of the loop, and continue with the next:

#Example
#Do not print banana:

fruits = ["apple", "banana", "cherry"]
for x in fruits:
  if x == "banana":
    continue
  print(x)

apple
cherry

In [39]:
#The range() Function
#To loop through a set of code a specified number of times, we can use the range() function,
#The range() function returns a sequence of numbers, starting from 0 by default, and increments by 1 (by default), and ends at a specified number.

#Example
#Using the range() function:

for x in range(7):
  print(x)

0
1
2
3
4
5
6

In [40]:
#Using the start parameter:

for x in range(2, 6):
  print(x)

2
3
4
5

In [42]:
#The range() function defaults to increment the sequence by 1, however it is possible to specify the increment value by adding a third parameter: range(2, 30, 3):

#Example
#Increment the sequence with 3 (default is 1):

for x in range(2, 30, 2):
  print(x)

2
4
6
8
10
12
14
16
18
20
22
24
26
28

In [43]:
#Else in For Loop
#The else keyword in a for loop specifies a block of code to be executed when the loop is finished:

#Example
#Print all numbers from 0 to 5, and print a message when the loop has ended:

for x in range(6):
  print(x)
else:
  print("Finally finished!")

0
1
2
3
4
5
Finally finished!

In [44]:
#Note: The else block will NOT be executed if the loop is stopped by a break statement.
#Break the loop when x is 3, and see what happens with the else block:

for x in range(6):
  if x == 3: break
  print(x)
else:
  print("Finally finished!")

0
1
2

In [50]:
#Nested Loops
#A nested loop is a loop inside a loop.

#The "inner loop" will be executed one time for each iteration of the "outer loop":

#Example
#Print each adjective for every fruit:

adj = ["red", "big", "tasty"]
fruits = ["apple", "banana", "cherry"]

for x in adj:
    for y in fruits:
        print(x, y)

red apple
red banana
red cherry
big apple
big banana
big cherry
tasty apple
tasty banana
tasty cherry

In [51]:
#FUNCTIONS

def my_function():
  print("Hello from a function")

In [55]:
my_function()

Hello from a function

In [62]:
#CREATING A DATAFRAME TABLE USING PANDAS

data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(data)

df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [73]:
df.groupby(['Team', 'Year']).groups

{('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('Kings', 2016): [6], ('Kings', 2017): [7], ('Riders', 2014): [0], ('Riders', 2015): [1], ('Riders', 2016): [8], ('Riders', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10], ('kings', 2015): [5]}

In [72]:
TY=df.groupby(['Team', 'Year']).groups
TY_table=pd.DataFrame(TY)
TY_table

  Devils      Kings           Riders                Royals      kings
    2014 2015  2014 2016 2017   2014 2015 2016 2017   2014 2015  2015
0      2    3     4    6    7      0    1    8   11      9   10     5

In [75]:
grouped = df.groupby('Year')
grouped

In [ ]:
#Dealing with missing value

#drop the whole row using dropna. used basically for column with missing strings
df.dropna(subset=['Outlet_Size'], axis=0, inplace=True)

##Replace NaN by mean value
df["Item_Weight"].fillna(df["Item_Weight"].mean(),inplace=True)

In [94]:
gh=[23.6,45.98,56,67,4.222,56.6,4,567,89,78,78.00]

In [95]:
import statistics

In [100]:
statistics.median(gh)

56.6

In [82]:
#EASIEST PLOTING CODE

fig = px.bar(Data name, y='Item_Outlet_Sales', x='Outlet_Location_Type', color='Outlet_Location_Type', title='Outlet location with the most overall sales') #to plot a bargraph
fig.show()

In [ ]:
#to display values in 2 decimal place

pd.set_option('display.float_format', lambda x: '%.2f' %x)

In [ ]:
df=df.dropna() #easiest way to drop rows with Na